//1부터 100까지 더하는 코드를 만들어라
let num = 0;

for (let i = 1; i <= 100; i++) {
  num += i;
}

console.log(num);

//1부터 100까지 곱하는 코드를 만들어라
let num = 1;

for (let i = 1; i <= 100; i++) {
  num *= i;
}

console.log(num);

/*[52, 273, 103, 32, 57, 103, 31, 2]와 같은 숫자 배열이 주어질 때, 
배열 내부에서 최대값과 최소값을 찾는 코드를 만들어라*/

/*prompt함수로 문자열을 입력받아 "안녕"이 들어가면 "안녕하세요."를 반환하고 
"잘 자" 또는 "잘 자"를 입력하면 "안녕히 주무세요."를 반환하는 코드를 작성해라*/

/*문자열을 입력받아 "안녕"이라는 글자가 들어있지 않으면 
"인사를 안하다니.."라고 반환하는 코드를 작성하라*/

/*숫자를 입력받아 4로 나눌 수 있는 숫자라면 
"4로 나눌 수 있는 숫자입니다."를 이외에는 4로 나눌 수 없는 숫자입니다."를 
반환하는 코드를 작성하라*/

/* 숫자를 입력받아 양수라면 "양수입니다." 
음수라면 "음수입니다." 0이라면 "0입니다."를 반환하는 코드를 작성하라*/
